IDEA Open Model
IDEAProgressReport.TotalProgressAmount Property
Compatible with IDEA StatiCa v 10.1
 total progress
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public int TotalProgressAmount { get; set; }
Public Property TotalProgressAmount As Integer
	Get
	Set
public:
property int TotalProgressAmount {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
IDEAProgressReport Class
IdeaRS.OpenModel.Message Namespace